{
  "ensemble": [
    {
      "name": "modelA",
      "modelTopology": {
        "class_name": "Model",
        "config": {
          "name": "model1",
          "layers": [
            {
              "name": "input1",
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  22
                ],
                "dtype": "float32",
                "sparse": false,
                "name": "input1"
              },
              "inbound_nodes": []
            },
            {
              "name": "dense_Dense1",
              "class_name": "Dense",
              "config": {
                "units": 128,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 2,
                    "mode": "fan_in",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                    "l1": 0,
                    "l2": 0.001
                  }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null,
                "name": "dense_Dense1",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "input1",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "batch_normalization_BatchNormalization1",
              "class_name": "BatchNormalization",
              "config": {
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "name": "batch_normalization_BatchNormalization1",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dense_Dense1",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "activation_Activation1",
              "class_name": "Activation",
              "config": {
                "activation": "relu",
                "name": "activation_Activation1",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "batch_normalization_BatchNormalization1",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dropout_Dropout1",
              "class_name": "Dropout",
              "config": {
                "rate": 0.35,
                "noise_shape": null,
                "seed": null,
                "name": "dropout_Dropout1",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "activation_Activation1",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dense_Dense2",
              "class_name": "Dense",
              "config": {
                "units": 64,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 2,
                    "mode": "fan_in",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                    "l1": 0,
                    "l2": 0.001
                  }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null,
                "name": "dense_Dense2",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dropout_Dropout1",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "batch_normalization_BatchNormalization2",
              "class_name": "BatchNormalization",
              "config": {
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "name": "batch_normalization_BatchNormalization2",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dense_Dense2",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "activation_Activation2",
              "class_name": "Activation",
              "config": {
                "activation": "relu",
                "name": "activation_Activation2",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "batch_normalization_BatchNormalization2",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dropout_Dropout2",
              "class_name": "Dropout",
              "config": {
                "rate": 0.3,
                "noise_shape": null,
                "seed": null,
                "name": "dropout_Dropout2",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "activation_Activation2",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dense_Dense3",
              "class_name": "Dense",
              "config": {
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 2,
                    "mode": "fan_in",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null,
                "name": "dense_Dense3",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dropout_Dropout2",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dropout_Dropout3",
              "class_name": "Dropout",
              "config": {
                "rate": 0.2,
                "noise_shape": null,
                "seed": null,
                "name": "dropout_Dropout3",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dense_Dense3",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            },
            {
              "name": "dense_Dense4",
              "class_name": "Dense",
              "config": {
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1,
                    "mode": "fan_avg",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null,
                "name": "dense_Dense4",
                "trainable": true
              },
              "inbound_nodes": [
                [
                  [
                    "dropout_Dropout3",
                    0,
                    0,
                    {}
                  ]
                ]
              ]
            }
          ],
          "input_layers": [
            [
              "input1",
              0,
              0
            ]
          ],
          "output_layers": [
            [
              "dense_Dense4",
              0,
              0
            ]
          ]
        },
        "keras_version": "tfjs-layers 4.22.0",
        "backend": "tensor_flow.js"
      },
      "weightSpecs": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            22,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense4/kernel",
          "shape": [
            32,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense4/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        }
      ],
      "weightData": 